{
  "onelab": {
    "details": [
      "Maintained a legacy codebase for over five years, successfully fixed numerous long-standing bugs, and gradually introduced unit testing and modular architecture, reducing maintenance costs and shortening subsequent development time by approximately 20%.",
      "Built a blockchain application on Polygon from scratch, integrated smart contracts, and implemented GitLab CI/CD automation. Successfully launched the product with the team within three months.",
      "Utilized AI tools such as GitHub Copilot and Claude to generate test code during project development and refactoring, reducing initial development time by around 30% and accelerating the refactoring cycle.",
      "Participated in a Cypress automation testing team, wrote and optimized test cases, effectively improving test coverage and maintenance efficiency across projects."
    ]
  },
  "adbert": {
    "details": [
      "Assisted in building an HC System for the company, supporting talent development and helping the HR department calculate and distribute bonuses over four consecutive quarters.",
      "Developed reusable and customizable chart components, shared across multiple projects, significantly improving productivity and development efficiency.",
      "Designed efficient and scalable state management flows using Redux, solving issues related to data persistence across page transitions and permission handling.",
      "Utilized custom hooks to encapsulate business logic, reducing code duplication and increasing reusability.",
      "Built a component library using Storybook, creating highly reusable and easily maintainable React components to enhance cross-project and cross-team collaboration.",
      "Implemented automated testing for components, saving development and testing time while increasing component stability."
    ]
  },
  "infopower": {
    "details": [
      "Maintained the email delivery system using Mailgun and AWS services.",
      "Implemented logging at critical points to resolve traffic monitoring issues on the official website.",
      "Integrated LINE Message and LINE Notify for push notification features."
    ]
  }
}
