{
  "onelab": {
    "details": [
      "Maintained legacy code for over five years and gradually upgraded and refactored Result pages from .NET View to React, reducing technical debt, improving page load speed, and lowering maintenance barriers.",
      "Developed different micro-frontends using React and TypeScript, optimized rendering performance with useMemo and useCallback, managed local state with Zustand, and handled API data management with React Query.",
      "Implemented Lazy Loading for complex, large-scale, and functionally independent codebases, reducing the core bundle by 15%, decreasing first-screen refresh time, and enhancing user experience.",
      "Built a Polygon blockchain application from scratch, integrating smart contracts with the MetaMask browser plugin, successfully launching the product with the team within three months.",
      "Used AI tools like GitHub Copilot and Claude to generate test code during development and refactoring projects, reducing initial development time by approximately 30% and accelerating refactoring iterations."
    ]
  },
  "adbert": {
    "details": [
      "Collaborated with the team to build an HR cloud system, primarily responsible for developing custom chart components using Chart.js and Canvas to visualize employee performance data, and assisted HR in calculating and distributing bonuses through this system.",
      "Worked with the design department to collect highly reusable React components that are easily modified across projects, managing them through a StoryBook component library to improve cross-departmental efficiency.",
      "Implemented automated testing for components using Jest, saving development and testing time while improving component stability."
    ]
  },
  "infopower": {
    "details": [
      "Implement click tracking on the official website to enable data analysts to conduct precise marketing analysis.",
      "Integrated third-party platforms Mailgun and AWS for email services.",
      "Integrated Line-message and Line-notify for push notifications and developed message templates."
    ]
  },
  "intro_greeting": "Hi, I'm Liu Chang",
  "intro_role": "Front-end Engineer",
  "intro_description": "I love trying new things and the feeling of building something from scratch. I’ve found real joy in exploring blockchain, algorithmic trading, and web development. Outside the screen, climbing and traveling keep me grounded and inspired.",
  "section_experience": "Experience",
  "section_skills": "Skills & Technologies",
  "section_others": "Others",
  "section_hikingJournal": "Hiking Journal",
  "hiking_description": "Some hiking record in Taiwan",
  "trading_title": "Programmatic trading of TAIEX Futures",
  "trading_description": "Built an automated trading system for TAIEX Futures."
}
